Tekla.Structures.PluginsInternal.Remoter
Summary description for Remoter.

Tekla.Structures.PluginsInternal.Remoter.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.PluginsInternal.Remoter.InitializeSandBox
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.PluginsInternal.Remoter.GetConnectionStatus
Initializes the connection to TS. Must be called before the first operation.